import React from "react";
import Accordion from "../../Common/Accordion";
import Landing2 from "../../../../public/img/Landing1.png"

function FAQ() {
  const QS = [
    {
      id: 1,
      title: "১. ফোকাসড মেসেজিং",
      ans: "ল্যান্ডিং পেজের মূল লক্ষ্য একটি নির্দিষ্ট অ্যাকশন সম্পাদন করা। এটি হোমপেজের মতো বিভিন্ন তথ্য দিয়ে ভরাট নয়, বরং একক উদ্দেশ্যে (যেমন: সাইন আপ, কেনাকাটা) ফোকাস করে।",
    },
    {
      id: 2,
      title: "২. উচ্চ কনভার্শন রেট",
      ans: "ল্যান্ডিং পেজে অপ্রয়োজনীয় অপশন বা লিঙ্ক থাকে না, তাই ব্যবহারকারীরা সহজেই কাঙ্ক্ষিত অ্যাকশনটি নিতে পারেন। ফলে কনভার্শন রেট উল্লেখযোগ্যভাবে বাড়ে।",
    },
    {
      id: 3,
      title: "৩. ক্যাম্পেইন অনুযায়ী কাস্টমাইজেশন",
      ans: "ল্যান্ডিং পেজ নির্দিষ্ট মার্কেটিং ক্যাম্পেইনের জন্য তৈরি করা যায়। উদাহরণস্বরূপ, গুগল অ্যাডস, ফেসবুক অ্যাডস, বা ইমেইল ক্যাম্পেইনের জন্য পৃথক পেজ তৈরি করে সেই বিজ্ঞাপনের সাথে সম্পূর্ণ মিল রেখে কাস্টমাইজ করা যায়।",
    },
    {
      id: 4,
      title: "৪. ভালো ব্যবহারকারীর অভিজ্ঞতা (User Experience)",
      ans: "ল্যান্ডিং পেজ ব্যবহারকারীদের জন্য প্রাসঙ্গিক এবং সরল অভিজ্ঞতা প্রদান করে। বিজ্ঞাপন বা লিঙ্ক থেকে যা প্রত্যাশিত, তা পেজে সঠিকভাবে উপস্থাপিত হয়, যা ব্যবহারকারীদের আকৃষ্ট করে।",
    },
    {
      id: 5,
      title: "৫. ডেটা সংগ্রহের সুযোগ",
      ans: "ল্যান্ডিং পেজ ব্যবহারকারীদের জন্য প্রাসঙ্গিক এবং সরল অভিজ্ঞতা প্রদান করে। বিজ্ঞাপন বা লিঙ্ক থেকে যা প্রত্যাশিত, তা পেজে সঠিকভাবে উপস্থাপিত হয়, যা ব্যবহারকারীদের আকৃষ্ট করে।",
    },
    {
      id: 6,
      title: "৬. বিজ্ঞাপনের কার্যকারিতা বৃদ্ধি",
      ans: "ল্যান্ডিং পেজ বিজ্ঞাপন ক্যাম্পেইনের রিলেভেন্স এবং মান উন্নত করে। উদাহরণস্বরূপ, গুগল অ্যাডসে একটি ভালো ল্যান্ডিং পেজ কোয়ালিটি স্কোর বাড়ায় এবং বিজ্ঞাপনের খরচ কমায়।",
    },
    {
      id: 7,
      title: "৭. সহজে এ/বি টেস্টিং করা যায়",
      ans: "ল্যান্ডিং পেজে বিভিন্ন হেডলাইন, কল-টু-অ্যাকশন (CTA), লে-আউট বা ভিজ্যুয়াল টেস্ট করা যায়। এর মাধ্যমে কোন ডিজাইন বা কনটেন্ট বেশি কার্যকরী তা বোঝা সহজ হয়।",
    },
    {
      id: 8,
      title: "৮. বিশ্বাস ও ক্রেডিবিলিটি বৃদ্ধি করে",
      ans: "ল্যান্ডিং পেজ ব্যবহারকারীদের জন্য প্রাসঙ্গিক এবং সরল অভিজ্ঞতা প্রদান করে। বিজ্ঞাপন বা লিঙ্ক থেকে যা প্রত্যাশিত, তা পেজে সঠিকভাবে উপস্থাপিত হয়, যা ব্যবহারকারীদের আকৃষ্ট করে।",
    },
    
  ];

  return (
    <section className="">
      <h1 className="text-primary text-xl text-center font-bold lg:font-[700] w-full lg:w-[80%] mx-auto shadow-custom-dark py-2">আপনার ব্যবসার জন্য ল্যান্ডিং পেজ কেন গুরুত্বপূর্ণ?</h1>
      <div className="flex flex-col-reverse gap-10 md:gap-0 md:grid md:grid-cols-1 lg:grid-cols-2 mt-10">
        <div className="">
            <div>
              <div className="space-y-5 ">
                {QS.map(({ id, title, ans }) => {
                  return <Accordion key={id} ques={title} ans={ans} />;
                })}
              </div>
          </div>
        </div>
        <div>
            <img src={Landing2} alt="Landing-img" className="md:h-screen xl:h-[60vh]" />
        </div>
        </div>
        
    </section>
  );
}

export default FAQ;
